In [1]:
import pandas as pd
import numpy as np #

In [2]:
#dataframe == schema 
#만드는 방법.. 
#1.외부파일을 읽어온다 (csv , xlsx)
#2.데이터 구조를 가지고 dataframe을 만들어주면 된다
#dic, lists
#항목명1      항목명2     항목명3    ===> dic(key)
#----------------------------------
# 100           200         300    ==> dic(val, list)
# 200          220          330 


#{"항목명1":[100,200], "항목명2":[200,220], "항목명3":[300,330]}

In [6]:
df=pd.DataFrame({"name":['홍길동', '박길동'],"age":[100,200], "ex":[1,2]})

In [7]:
df.describe()
#COUNT  갯수 
#MEAN  평균
#

              age        ex
count    2.000000  2.000000
mean   150.000000  1.500000
std     70.710678  0.707107
min    100.000000  1.000000
25%    125.000000  1.250000
50%    150.000000  1.500000
75%    175.000000  1.750000
max    200.000000  2.000000

In [9]:
import random
name_list=[]
age_list=[]
ex_list=[]
for i in range (1000):
    name_list.append('name'+str(i))
    age_list.append(random.randint(1,120))
    ex_list.append(random.randint(1,2))

len(name_list), len (age_list), len(ex_list)

(1000, 1000, 1000)

In [13]:
name_list[:10]
age_list[:10]
ex_list[:10]

[1, 1, 2, 1, 1, 2, 1, 2, 1, 1]

In [21]:
# 1.데이터 프레임으로 만들기
df2=pd.DataFrame({"name":name_list, "age":age_list, "ex":ex_list})

               age           ex
count  1000.000000  1000.000000
mean     62.125000     1.496000
std      34.745167     0.500234
min       1.000000     1.000000
25%      33.000000     1.000000
50%      62.000000     1.000000
75%      94.000000     2.000000
max     120.000000     2.000000

In [23]:

# 2. 각 칼럼의 데이터 타입 확인


df.dtypes

#object == string

name    object
age      int64
ex       int64
dtype: object

In [31]:
# 3. 각 칼럼의 데이터 타입 추출
df2['name']
df2['age']
df2['ex']

0      1
1      1
2      2
3      1
4      1
      ..
995    1
996    1
997    1
998    1
999    1
Name: ex, Length: 1000, dtype: int64

In [32]:
# 4. 숫자형 칼럼의 요약
df2.describe()

               age           ex
count  1000.000000  1000.000000
mean     62.125000     1.496000
std      34.745167     0.500234
min       1.000000     1.000000
25%      33.000000     1.000000
50%      62.000000     1.000000
75%      94.000000     2.000000
max     120.000000     2.000000

In [40]:
df2['age']-10 #브로드캐스팅
#원본을 가져다가 처리하므로 df2는 바뀌지 않음(비파괴연산)
df2['age'] = df2['age']-10 
df2['age']

0       12
1       -8
2       99
3      100
4       68
      ...
995     10
996    -10
997     44
998     86
999     88
Name: age, Length: 1000, dtype: int64

In [41]:
df2['name']=df2['name']+"님"

df2['name']

0        name0님
1        name1님
2        name2님
3        name3님
4        name4님
         ...
995    name995님
996    name996님
997    name997님
998    name998님
999    name999님
Name: name, Length: 1000, dtype: object

In [48]:
len(df2['age'][df2['age']>95])
# df2['age'][df2['age']>95]
#df[컬렴명][조건]: 조건이 True 인것만 추출

52

In [52]:
df2.loc[0] #loc[행]
df2.loc[:, 'name'] #loc[행, 열]   == df,name

0        name0님
1        name1님
2        name2님
3        name3님
4        name4님
         ...
995    name995님
996    name996님
997    name997님
998    name998님
999    name999님
Name: name, Length: 1000, dtype: object

In [54]:

#   name  |   age    |   ex
# ----------------------------

df2.loc[:, 'name':'ex']  # name 부터 ex 까지  다 추출하겠다

         name  age  ex
0      name0님   12   1
1      name1님   -8   1
2      name2님   99   2
3      name3님  100   1
4      name4님   68   1
..        ...  ...  ..
995  name995님   10   1
996  name996님  -10   1
997  name997님   44   1
998  name998님   86   1
999  name999님   88   1

[1000 rows x 3 columns]

In [56]:
df2.loc[0:2, 'name':'age']

     name  age
0  name0님   12
1  name1님   -8
2  name2님   99

In [68]:
df['add_column'] = df['age'] + df['ex']
#기본의 컬럼에 새로운 컬럼추가 가능 (파생한다, 파생컬럼, 파생변수)
# df['만들고싶은 컬럼명']=df[기존컬럼]+df[기존컬럼]
df2['add_column'] = df2['age'] + df2['ex']
df2['age_next'] = df2['age'] + 1
df['age_next'] = df['age'] + 1
df

  name  age  ex  add_column  age_next
0  aaa  100   1         101       101
1  박길동  200   2         202       201

In [64]:
df.loc[0, 'name']='aaa'
df.loc[0, 'name']

'aaa'

In [65]:
df.iloc[0, 0]

'aaa'

In [67]:
df.iloc[0, 3] 
df.iloc[1, 4]

201

In [79]:
df.loc[0, 'add_column']
df.loc[0]['add_column']
df2.loc[0]['add_column']

13

In [81]:
df.loc[1, 'age_next']
df.loc[1]['age_next']
df.loc[1][3]

202

In [71]:
df.loc[1, 'age_next']=300
df.loc[0, 'add_column']=200

In [74]:
df

  name  age  ex  add_column  age_next
0  aaa  100   1         200       101
1  박길동  200   2         202       300

In [75]:
df.columns

Index(['name', 'age', 'ex', 'add_column', 'age_next'], dtype='object')

In [76]:
df.index

RangeIndex(start=0, stop=2, step=1)

In [77]:
df.values #중요!!==>ndarrat class
#n :숫자(차원수, 1차원이면 1, 2차원이면 2)
#d : 차원(dimension)
#array : 리스트
#pandas에서는 여러차원의 데이터를 한아ㅢ 클래스로 처리하기(다루기) 위해서 
#여러차원의 데이터를 다룰수있는 ndarray라는 클래스를 만들어 놓았음

array([['aaa', 100, 1, 200, 101],
       ['박길동', 200, 2, 202, 300]], dtype=object)